StratifyLabs/StratifyOS-mcu-stm32/src/usb/usb_otg_fs_dev.c
/* Copyright 2011-2018 Tyler Gilbert;
 * This file is part of Stratify OS.
 *
 * Stratify OS is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * Stratify OS is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with Stratify OS.  If not, see <http://www.gnu.org/licenses/>.
 *
 *
 */

#include <cortexm/cortexm.h>
#include <fcntl.h>
#include <mcu/core.h>
#include <mcu/pio.h>
#include <mcu/usb.h>
#include <sos/config.h>
#include <sos/debug.h>
#include <sos/events.h>
#include <usbd/types.h>

#include "stm32_local.h"

#if MCU_USB_PORTS > 0

static void usb_connect(const devfs_handle_t *handle, u32 con);
static void usb_configure(const devfs_handle_t *handle, u32 cfg);
static void usb_set_address(const devfs_handle_t *handle, u32 addr);
static void usb_reset_endpoint(const devfs_handle_t *handle, u32 endpoint_num);
static void usb_flush_endpoint(const devfs_handle_t *handle, u32 endpoint_num);
static void usb_enable_endpoint(const devfs_handle_t *handle, u32 endpoint_num);
static void
usb_disable_endpoint(const devfs_handle_t *handle, u32 endpoint_num);
static void usb_stall_endpoint(const devfs_handle_t *handle, u32 endpoint_num);
static void
usb_unstall_endpoint(const devfs_handle_t *handle, u32 endpoint_num);
static void usb_configure_endpoint(
  const devfs_handle_t *handle,
  u32 endpoint_num,
  u32 max_packet_size,
  u8 type);
static void usb_reset(const devfs_handle_t *handle);

static usb_state_t *m_usb_state_list[MCU_USB_PORTS] MCU_SYS_MEM;

static USB_OTG_GlobalTypeDef *const usb_regs_table[MCU_USB_PORTS]
  = MCU_USB_REGS;
static u8 const usb_irqs[MCU_USB_PORTS] = MCU_USB_IRQS;
static void clear_callbacks(usb_state_t *state);

void clear_callbacks(usb_state_t *state) {

  memset(
    state->transfer_handler,
    0,
    (MCU_USB_ENDPOINT_COUNT) * sizeof(devfs_transfer_handler_t));
  memset(&state->control_handler, 0, sizeof(mcu_event_handler_t));
  memset(&state->special_event_handler, 0, sizeof(mcu_event_handler_t));
  memset(state->rx_buffer_offset, 0, MCU_USB_ENDPOINT_COUNT * sizeof(u16));
  state->rx_buffer_used = 0;
}

DEVFS_MCU_DRIVER_IOCTL_FUNCTION(
  usb,
  USB_VERSION,
  USB_IOC_IDENT_CHAR,
  I_MCU_TOTAL + I_USB_TOTAL,
  mcu_usb_isconnected)

int mcu_usb_open(const devfs_handle_t *handle) {
  DEVFS_DRIVER_DECLARE_CONFIG_STATE(usb);
  if (state->ref_count == 0) {
    DEVFS_DRIVER_OPEN_STATE_LOCAL_V4(usb);
    // Set callbacks to NULL
    state->connected = 0;
    clear_callbacks(state);
    state->hal_handle.Instance = usb_regs_table[config->port];

    if (config->port == 0) {
#if MCU_USB_API > 0
      __HAL_RCC_USB_OTG_FS_CLK_ENABLE();
#else
      __HAL_RCC_USB_CLK_ENABLE();
#endif
    } else {
#if MCU_USB_PORTS > 1
#if defined __HAL_RCC_OTGPHYC_CLK_ENABLE
      __HAL_RCC_OTGPHYC_CLK_ENABLE();
#endif
      __HAL_RCC_USB_OTG_HS_CLK_ENABLE();
      __HAL_RCC_USB_OTG_HS_ULPI_CLK_ENABLE();
#endif
    }
    cortexm_enable_irq(usb_irqs[config->port]); // Enable USB IRQ
  }
  state->ref_count++;
  return 0;
}

int mcu_usb_close(const devfs_handle_t *handle) {
  DEVFS_DRIVER_DECLARE_CONFIG_STATE(usb);
  if (state->ref_count > 0) {
    if (state->ref_count == 1) {
      HAL_PCD_Stop(&state->hal_handle);
      cortexm_disable_irq(usb_irqs[config->port]); // Disable the USB interrupt
      state->hal_handle.Instance = 0;
      if (config->port == 0) {
#if MCU_USB_API > 0
        __HAL_RCC_USB_OTG_FS_CLK_DISABLE();
#else
        __HAL_RCC_USB_CLK_DISABLE();
#endif
      } else {
#if MCU_USB_PORTS > 1
#if defined __HAL_RCC_OTGPHYC_CLK_DISABLE
        __HAL_RCC_OTGPHYC_CLK_DISABLE();
#endif
        __HAL_RCC_USB_OTG_HS_CLK_DISABLE();
        __HAL_RCC_USB_OTG_HS_ULPI_CLK_DISABLE();
#endif
      }
      DEVFS_DRIVER_CLOSE_STATE_LOCAL_V4(usb);
    }
    state->ref_count--;
  }
  return 0;
}

int mcu_usb_getinfo(const devfs_handle_t *handle, void *ctl) {
  usb_info_t *info = ctl;

  info->o_flags = 0;
  info->o_events = 0;
  return 0;
}

int mcu_usb_setattr(const devfs_handle_t *handle, void *ctl) {
  DEVFS_DRIVER_DECLARE_CONFIG_STATE(usb);
  u32 port = config->port;

  const usb_attr_t *attr = DEVFS_ASSIGN_ATTRIBUTES(usb, ctl);

  if (attr == 0) {
    return SYSFS_SET_RETURN(ENOSYS);
  }
  u32 o_flags = attr->o_flags;

  if (o_flags & USB_FLAG_SET_DEVICE) {
    // Start the USB clock
    int result;

    state->read_ready = 0;
    state->write_pending = 0;

    result = mcu_set_pin_assignment(
      &(attr->pin_assignment),
      MCU_CONFIG_PIN_ASSIGNMENT(usb_config_t, handle),
      MCU_PIN_ASSIGNMENT_COUNT(usb_pin_assignment_t),
      CORE_PERIPH_USB,
      port,
      0,
      0,
      0);

    if (result < 0) {
      return result;
    }

#if defined STM32L4
    if (__HAL_RCC_PWR_IS_CLK_DISABLED()) {
      __HAL_RCC_PWR_CLK_ENABLE();
      HAL_PWREx_EnableVddUSB();
      __HAL_RCC_PWR_CLK_DISABLE();
    } else {
      HAL_PWREx_EnableVddUSB();
    }
#endif

    if (port == 0) {
      state->hal_handle.Init.dev_endpoints = MCU_USB_ENDPOINT_COUNT;
      state->hal_handle.Init.speed = PCD_SPEED_FULL;
      state->hal_handle.Init.phy_itface = PCD_PHY_EMBEDDED;
    } else {
#if MCU_USB_PORTS > 1
      state->hal_handle.Init.dev_endpoints = MCU_USB_ENDPOINT_COUNT;
      if (o_flags & USB_FLAG_IS_HIGH_SPEED) {
        state->hal_handle.Init.speed = USB_OTG_SPEED_HIGH;
      } else {
        state->hal_handle.Init.speed = USB_OTG_SPEED_HIGH_IN_FULL;
      }

      // Need a flag to check for HW interface
      state->hal_handle.Init.phy_itface = USB_OTG_HS_EMBEDDED_PHY;
#endif
    }
    state->hal_handle.Init.dma_enable = DISABLE;
    state->hal_handle.Init.ep0_mps = DEP0CTL_MPS_64;
    if (sos_config.usb.control_endpoint_max_size <= 8) {
      state->hal_handle.Init.ep0_mps = DEP0CTL_MPS_8;
    } else if (sos_config.usb.control_endpoint_max_size <= 16) {
      state->hal_handle.Init.ep0_mps = DEP0CTL_MPS_16;
    } else if (sos_config.usb.control_endpoint_max_size <= 32) {
      state->hal_handle.Init.ep0_mps = DEP0CTL_MPS_32;
    }

    state->hal_handle.Init.Sof_enable = DISABLE;
    state->hal_handle.Init.low_power_enable = DISABLE;

#if !defined STM32F2
    state->hal_handle.Init.lpm_enable = DISABLE;
    state->hal_handle.Init.battery_charging_enable = DISABLE;
#endif

#if MCU_USB_API > 0
    state->hal_handle.Init.vbus_sensing_enable = DISABLE;
    state->hal_handle.Init.use_dedicated_ep1 = DISABLE;
    state->hal_handle.Init.use_external_vbus = DISABLE;

    if (o_flags & USB_FLAG_IS_VBUS_SENSING_ENABLED) {
      state->hal_handle.Init.vbus_sensing_enable = ENABLE;
    }
#endif

    if (o_flags & USB_FLAG_IS_SOF_ENABLED) {
      state->hal_handle.Init.Sof_enable = ENABLE;
    }

#if !defined STM32F2
    if (o_flags & USB_FLAG_IS_LOW_POWER_MODE_ENABLED) {
      state->hal_handle.Init.lpm_enable = ENABLE;
    }

    if (o_flags & USB_FLAG_IS_BATTERY_CHARGING_ENABLED) {
      state->hal_handle.Init.battery_charging_enable = ENABLE;
    }
#endif

