StratifyLabs/StratifyOS-mcu-stm32/src/usb/usb_otg_fs_dev.c
int mcu_usb_read(const devfs_handle_t *handle, devfs_async_t *async) {
  DEVFS_DRIVER_DECLARE_CONFIG_STATE(usb);

  int loc = async->loc;
  if (loc > (MCU_USB_ENDPOINT_COUNT - 1)) {
    return SYSFS_SET_RETURN(EINVAL);
  }

  DEVFS_DRIVER_IS_BUSY(state->transfer_handler[loc].read, async);

  int result;

  // Synchronous read (only if data is ready) otherwise 0 is returned
  if (state->read_ready & (1 << loc)) {
    result = mcu_usb_root_read_endpoint(handle, loc, async->buf);
    if (result == 0) {
      result = SYSFS_SET_RETURN(EAGAIN);
    }
  } else {
    if (!(async->flags & O_NONBLOCK)) {
      // If this is a blocking call, set the callback and context
      if (cortexm_validate_callback(async->handler.callback) < 0) {
        result = SYSFS_SET_RETURN(EPERM);
      } else {
        result = 0;
      }
    } else {
      result = SYSFS_SET_RETURN(EAGAIN);
    }
  }

  if (result != 0) {
    state->transfer_handler[loc].read = 0;
  }

  return result;
}

int mcu_usb_write(const devfs_handle_t *handle, devfs_async_t *async) {
  // Asynchronous write
  DEVFS_DRIVER_DECLARE_CONFIG_STATE(usb);

  int loc = async->loc;
  int ep;
  ep = (loc & 0x7F);
  if (ep > (MCU_USB_ENDPOINT_COUNT - 1)) {
    return SYSFS_SET_RETURN(EINVAL);
  }

  DEVFS_DRIVER_IS_BUSY(state->transfer_handler[ep].write, async);

  int bytes_written;

  if (cortexm_validate_callback(async->handler.callback) < 0) {
    return SYSFS_SET_RETURN(EPERM);
  }

  state->write_pending |= (1 << ep);
  bytes_written
    = mcu_usb_root_write_endpoint(handle, loc, async->buf, async->nbyte);

  if (bytes_written < 0) {
    usb_disable_endpoint(handle, loc);
    usb_reset_endpoint(handle, loc);
    usb_enable_endpoint(handle, loc);
  }

  if (bytes_written != 0) {
    state->transfer_handler[loc].write = 0;
    state->write_pending &= ~(1 << ep);
  }

  return bytes_written;
}

void usb_reset(const devfs_handle_t *handle) {}

void usb_wakeup(int port) {}

void usb_set_address(const devfs_handle_t *handle, u32 addr) {
  DEVFS_DRIVER_DECLARE_CONFIG_STATE(usb);
  HAL_PCD_SetAddress(&state->hal_handle, addr);
}

void usb_configure(const devfs_handle_t *handle, u32 cfg) {
  // m_usb_state_list[config->port].connected = 1;
}

void usb_configure_endpoint(
  const devfs_handle_t *handle,
  u32 endpoint_num,
  u32 max_packet_size,
  u8 type) {
  DEVFS_DRIVER_DECLARE_CONFIG_STATE(usb);

  HAL_PCD_EP_Open(
    &state->hal_handle,
    endpoint_num,
    max_packet_size,
    type & EP_TYPE_MSK);
  // m_usb_state_list[config->port].connected = 1;

  if ((endpoint_num & 0x80) == 0) {
    void *dest_buffer;

    if (state->rx_buffer_offset[endpoint_num] == 0) {
      state->rx_buffer_offset[endpoint_num] = state->rx_buffer_used;

      state->rx_buffer_used += (max_packet_size * 2);
      if (state->rx_buffer_used > stm32_config.usb.rx_buffer_size) {
        // this is a fatal error -- using sos_debug_ will cause bootloader link
        // problems
        sos_handle_event(SOS_EVENT_ROOT_FATAL, "usbbuf");
      }
    }

    dest_buffer = stm32_config.usb.rx_buffer
                  + state->rx_buffer_offset[endpoint_num] + max_packet_size;

    HAL_PCD_EP_Receive(
      &state->hal_handle,
      endpoint_num,
      dest_buffer,
      max_packet_size);
  }
}

void usb_enable_endpoint(const devfs_handle_t *handle, u32 endpoint_num) {}

void usb_disable_endpoint(const devfs_handle_t *handle, u32 endpoint_num) {
  DEVFS_DRIVER_DECLARE_CONFIG_STATE(usb);
  HAL_PCD_EP_Close(&state->hal_handle, endpoint_num);
}

void usb_reset_endpoint(const devfs_handle_t *handle, u32 endpoint_num) {}

void usb_flush_endpoint(const devfs_handle_t *handle, u32 endpoint_num) {
  DEVFS_DRIVER_DECLARE_CONFIG_STATE(usb);
  PCD_HandleTypeDef *hpcd = &state->hal_handle;
  u8 logical_endpoint = endpoint_num & ~0x80;

  if (((endpoint_num & 0x80)
       && (hpcd->IN_ep[logical_endpoint].type == EP_TYPE_ISOC))) {
    HAL_PCD_EP_Close(hpcd, endpoint_num);
    HAL_PCD_EP_Open(
      hpcd,
      endpoint_num,
      hpcd->IN_ep[logical_endpoint].maxpacket,
      EP_TYPE_ISOC);
  } else if ((((endpoint_num & 0x80) == 0)
              && (hpcd->OUT_ep[logical_endpoint].type == EP_TYPE_ISOC))) {
    HAL_PCD_EP_Close(hpcd, endpoint_num);
    HAL_PCD_EP_Open(
      hpcd,
      endpoint_num,
      hpcd->OUT_ep[logical_endpoint].maxpacket,
      EP_TYPE_ISOC);
  }
  HAL_PCD_EP_Flush(hpcd, endpoint_num);
}

void usb_stall_endpoint(const devfs_handle_t *handle, u32 endpoint_num) {
  DEVFS_DRIVER_DECLARE_CONFIG_STATE(usb);
  HAL_PCD_EP_SetStall(&state->hal_handle, endpoint_num);
}

void usb_unstall_endpoint(const devfs_handle_t *handle, u32 endpoint_num) {
  DEVFS_DRIVER_DECLARE_CONFIG_STATE(usb);
  HAL_PCD_EP_ClrStall(&state->hal_handle, endpoint_num);
}

int mcu_usb_isconnected(const devfs_handle_t *handle, void *ctl) {
  DEVFS_DRIVER_DECLARE_CONFIG_STATE(usb);
  return state->connected;
}

void usb_clr_ep_buf(const devfs_handle_t *handle, u32 endpoint_num) {}

int mcu_usb_root_read_endpoint(
  const devfs_handle_t *handle,
  u32 endpoint_num,
  void *dest) {
  DEVFS_DRIVER_DECLARE_CONFIG_STATE(usb);
  void *src_buffer;
  u8 epnum;
  epnum = endpoint_num & 0x7f;

  if (state->read_ready & (1 << epnum)) {
    state->read_ready &= ~(1 << epnum);
    src_buffer = stm32_config.usb.rx_buffer + state->rx_buffer_offset[epnum];
    // data is copied from fifo to buffer during the interrupt
    memcpy(dest, src_buffer, state->rx_count[epnum]);
    return state->rx_count[epnum];
  }

  return -1;
}

int mcu_usb_root_write_endpoint(
  const devfs_handle_t *handle,
  u32 endpoint_num,
  const void *src,
  u32 size) {
  int ret;

  DEVFS_DRIVER_DECLARE_CONFIG_STATE(usb);
#if MCU_USB_API > 0
  int logical_endpoint = endpoint_num & 0x7f;
  int type = state->hal_handle.IN_ep[logical_endpoint].type;
  if (type == EP_TYPE_ISOC) {
    // check to see if the packet will fit in the FIFO
    // if the packet won't fit, return EBUSY
#if !defined STM32H7
    USB_OTG_GlobalTypeDef *USBx = state->hal_handle.Instance;
    int available
      = (USBx_INEP(logical_endpoint)->DTXFSTS & USB_OTG_DTXFSTS_INEPTFSAV);
    if ((available * 4) < size) {
      return SYSFS_SET_RETURN(EBUSY);
    }
#endif
  }
#endif

  ret
    = HAL_PCD_EP_Transmit(&state->hal_handle, endpoint_num, (void *)src, size);
  if (ret == HAL_OK) {
#if 0
    if (type == EP_TYPE_ISOC) {
      return size;
    }
#endif
    return 0;
  }

  return SYSFS_SET_RETURN(EIO);
}

void HAL_PCD_SetupStageCallback(PCD_HandleTypeDef *hpcd) {
  usb_state_t *state = (usb_state_t *)hpcd;
  // a setup packet has been received
  usb_event_t event;
  event.epnum = 0;
  void *dest_buffer;
  usbd_setup_packet_t *setup = (usbd_setup_packet_t *)&hpcd->Setup;

