StratifyLabs/StratifyOS-mcu-stm32/src/usb/usb_otg_fs_dev.c
  // Setup data is in hpcd->Setup buffer at this point

  // copy setup data to ep0 data buffer
  state->read_ready |= (1 << 0);
  dest_buffer = stm32_config.usb.rx_buffer + state->rx_buffer_offset[0];
  state->rx_count[0] = sizeof(usbd_setup_packet_t);
  memcpy(dest_buffer, hpcd->Setup, state->rx_count[0]);

  devfs_execute_event_handler(
    &state->control_handler,
    MCU_EVENT_FLAG_SETUP,
    &event);

  // prepare EP zero for receiving out data
  if (
    (setup->bmRequestType.bitmap_t.dir
     == USBD_REQUEST_TYPE_DIRECTION_HOST_TO_DEVICE)
    && (setup->wLength > 0)) {

    // prepare the endpoint to receive some data
    HAL_PCD_EP_Receive(
      hpcd,
      0,
      stm32_config.usb.rx_buffer + hpcd->OUT_ep[0].maxpacket,
      setup->wLength);
  }
}

void HAL_PCD_DataOutStageCallback(PCD_HandleTypeDef *hpcd, uint8_t epnum) {
  usb_state_t *state = (usb_state_t *)hpcd;
  // data has already been received and is stored in buffer specified by
  // HAL_PCD_EP_Receive
  usb_event_t event;
  event.epnum = epnum;
  u16 count;
  void *src_buffer;
  void *dest_buffer;

  // set read ready flag
  count = HAL_PCD_EP_GetRxCount(&state->hal_handle, epnum);

  dest_buffer = stm32_config.usb.rx_buffer + state->rx_buffer_offset[epnum];
  src_buffer = dest_buffer + hpcd->OUT_ep[epnum].maxpacket;
  memcpy(dest_buffer, src_buffer, count); // free up the source buffer

  // prepare to receive the next packet in the local buffer for non-control
  // endpoints
  if (epnum != 0) {
    HAL_PCD_EP_Receive(hpcd, epnum, src_buffer, hpcd->OUT_ep[epnum].maxpacket);
  }

  state->rx_count[epnum] = count;
  if (count > 0) {
    if (epnum == 0) {
      state->read_ready |= (1 << epnum);
      devfs_execute_event_handler(
        &state->control_handler,
        MCU_EVENT_FLAG_DATA_READY,
        &event);
    } else if (state->transfer_handler[epnum].read) {
      devfs_async_t *async = state->transfer_handler[epnum].read;
      if (count > async->nbyte) {
        count = async->nbyte;
      }
      // copy directly to the async buffer that is waiting for data
      memcpy(state->transfer_handler[epnum].read->buf, dest_buffer, count);
      state->read_ready &= ~(1 << epnum);
      devfs_execute_read_handler(
        state->transfer_handler + epnum,
        &event,
        count,
        MCU_EVENT_FLAG_DATA_READY);
    } else {
      // data is ready to read synchronously
      state->read_ready |= (1 << epnum);
    }
  }
}

void HAL_PCD_DataInStageCallback(PCD_HandleTypeDef *hpcd, uint8_t epnum) {
  usb_state_t *state = (usb_state_t *)hpcd;
  u8 logical_ep = epnum & 0x7f;
  usb_event_t event;
  event.epnum = epnum;

  state->write_pending &= ~(1 << logical_ep);

  // devfs_execute_write_handler(usb->transfer_handlers + logical_ep, &event, 0,
  // MCU_EVENT_FLAG_WRITE_COMPLETE);

  if (logical_ep == 0) {
    devfs_execute_event_handler(
      &state->control_handler,
      MCU_EVENT_FLAG_WRITE_COMPLETE,
      &event);

    // only proceed it DataIn tx'd more than zero bytes
    if (hpcd->IN_ep[0].xfer_count == 0) {
      return;
    }

    // ep 0 data in complete
    // prepare EP0 for next setup packet
    HAL_PCD_EP_Receive(hpcd, 0, 0, 0);
  } else {
    devfs_execute_write_handler(
      state->transfer_handler + logical_ep,
      &event,
      hpcd->IN_ep[logical_ep].xfer_count,
      0);
  }
}

void HAL_PCD_SOFCallback(PCD_HandleTypeDef *hpcd) {}

void HAL_PCD_ResetCallback(PCD_HandleTypeDef *hpcd) {
  int i;

  usb_state_t *usb = (usb_state_t *)hpcd;
  const u32 mps = sos_config.usb.control_endpoint_max_size;
  usb->connected = 1;
  usb->rx_buffer_used = mps;
  memset(usb->rx_buffer_offset, 0, MCU_USB_ENDPOINT_COUNT * sizeof(u16));
  for (i = 0; i < MCU_USB_ENDPOINT_COUNT; i++) {
    usb->rx_buffer_offset[i] = 0;
  }

  HAL_PCD_SetAddress(hpcd, 0);

  HAL_PCD_EP_Open(hpcd, 0x00, mps, EP_TYPE_CTRL);
  HAL_PCD_EP_Open(hpcd, 0x80, mps, EP_TYPE_CTRL);
}

void HAL_PCD_SuspendCallback(PCD_HandleTypeDef *hpcd) {
  usb_state_t *usb = (usb_state_t *)hpcd;
  usb->connected = 0;

#if MCU_USB_API > 0
  __HAL_PCD_GATE_PHYCLOCK(hpcd);
#endif

#if 0
  // this causes problems when USB cable is removed -- don't do it
  HAL_PCD_EP_Close(hpcd, 0x00);
  HAL_PCD_EP_Close(hpcd, 0x80);
#endif
}

void HAL_PCD_ResumeCallback(PCD_HandleTypeDef *hpcd) {
  usb_state_t *usb = (usb_state_t *)hpcd;
  usb->connected = 1;
}

void HAL_PCD_ISOINIncompleteCallback(PCD_HandleTypeDef *hpcd, uint8_t epnum) {

  // epnum value passed is not valid -- need to find it
  int i;
  for (i = 1; i < MCU_USB_ENDPOINT_COUNT; i++) {
    if (hpcd->IN_ep[i].type == EP_TYPE_ISOC) {

      epnum = 0x80 | i;
      u8 logical_ep = epnum & 0x7F;

      // Close will disable the endpoint and flush the TX FIFO
      if (HAL_PCD_EP_Close(hpcd, epnum) != HAL_OK) {
      }

      if (
        HAL_PCD_EP_Open(
          hpcd,
          epnum,
          hpcd->IN_ep[logical_ep].maxpacket,
          EP_TYPE_ISOC)
        != HAL_OK) {
      }

      usb_state_t *state = (usb_state_t *)hpcd;
      devfs_execute_write_handler(
        state->transfer_handler + logical_ep,
        0,
        SYSFS_SET_RETURN(EIO),
        MCU_EVENT_FLAG_ERROR | MCU_EVENT_FLAG_CANCELED);
    }
  }
}

void HAL_PCD_ISOOUTIncompleteCallback(PCD_HandleTypeDef *hpcd, uint8_t epnum) {}

void HAL_PCD_ConnectCallback(PCD_HandleTypeDef *hpcd) {
  MCU_UNUSED_ARGUMENT(hpcd);
  // this is never called -- Reset callback is called when connection is
  // established
}

void HAL_PCD_DisconnectCallback(PCD_HandleTypeDef *hpcd) {
  MCU_UNUSED_ARGUMENT(hpcd);
  // this is never called -- Suspend callback is called when connection is lost
}

void mcu_core_otg_fs_isr() {
  HAL_PCD_IRQHandler(&m_usb_state_list[0]->hal_handle);
}

#if MCU_USB_PORTS > 1
void mcu_core_otg_hs_isr() {
  HAL_PCD_IRQHandler(&m_usb_state_list[1].hal_handle);
}
#endif

#endif
